ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/HID_Standalone/Src/main.c
  0x01, 0xc0
  };
//}}}

//{{{
static uint8_t hidInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  uint8_t ret = 0;

  /* Open EP IN */
  USBD_LL_OpenEP(device, HID_EPIN_ADDR, USBD_EP_TYPE_INTR, HID_EPIN_SIZE);

  device->pClassData = malloc (sizeof (tHidData));

  if (device->pClassData == NULL)
    ret = 1;
  else
    ((tHidData*)device->pClassData)->state = HID_IDLE;
  return ret;
  }
//}}}
//{{{
static uint8_t hidDeInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  /* Close HID EPs */
  USBD_LL_CloseEP(device, HID_EPIN_ADDR);

  /* FRee allocated memory */
  if(device->pClassData != NULL) {
    free(device->pClassData);
    device->pClassData = NULL;
    }

  return USBD_OK;
  }
//}}}
//{{{
static uint8_t hidSetup (USBD_HandleTypeDef* device, USBD_SetupReqTypedef* req) {

  tHidData* hidData = (tHidData*)device->pClassData;
  debug (LCD_COLOR_YELLOW, "setup bmReq%d req:%d value:%x", req->bmRequest, req->bRequest, req->wValue);

  switch (req->bmRequest & USB_REQ_TYPE_MASK) {
    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest) {
        case USB_REQ_GET_DESCRIPTOR: {
          if (req->wValue >> 8 == HID_REPORT_DESC) {
            debug (LCD_COLOR_GREEN, "- getDescriptor report len:%d", req->wLength);
            USBD_CtlSendData (device, (uint8_t*)hidMouseReportDesc, MIN (74, req->wLength));
            }
          else if (req->wValue >> 8 == HID_DESCRIPTOR_TYPE) {
            debug (LCD_COLOR_GREEN, "- getDescriptor hid");
            USBD_CtlSendData (device, (uint8_t*)hidDesc, MIN(9 , req->wLength));
            }
          break;
          }
        case USB_REQ_GET_INTERFACE :
          debug (LCD_COLOR_GREEN, "- getInterface");
          USBD_CtlSendData (device, (uint8_t*)&hidData->AltSetting, 1);
          break;
        case USB_REQ_SET_INTERFACE :
          debug (LCD_COLOR_GREEN, "- setInterface");
          hidData->AltSetting = (uint8_t)(req->wValue);
          break;
        }
      break;

    case USB_REQ_TYPE_CLASS :
      switch (req->bRequest) {
        case HID_REQ_SET_PROTOCOL:
          hidData->Protocol = (uint8_t)(req->wValue);
          debug (LCD_COLOR_GREEN, "- setProtocol %d", req->wValue);
          break;
        case HID_REQ_GET_PROTOCOL:
          USBD_CtlSendData (device, (uint8_t*)&hidData->Protocol, 1);
          debug (LCD_COLOR_GREEN, "- getProtocol %d", hidData->Protocol);
          break;
        case HID_REQ_SET_IDLE:
          hidData->IdleState = (uint8_t)(req->wValue >> 8);
          debug (LCD_COLOR_GREEN, "- setIdle %d", req->wValue);
          break;
        case HID_REQ_GET_IDLE:
          USBD_CtlSendData (device, (uint8_t*)&hidData->IdleState, 1);
          debug (LCD_COLOR_GREEN, "- getIdle %d", hidData->IdleState);
          break;
        default:
          USBD_CtlError (device, req);
          return USBD_FAIL;
        }
      break;
      }

  return USBD_OK;
  }
//}}}

//{{{
static uint8_t* hidGetCfgDesc (uint16_t* length) {
  *length = sizeof(hidCfgDesc);
  return (uint8_t*)hidCfgDesc;
  }
//}}}
//{{{
static uint8_t hidDataIn (USBD_HandleTypeDef* device, uint8_t epnum) {
  /* Ensure that the FIFO is empty before a new transfer, this condition could
  be caused by  a new transfer before the end of the previous transfer */
  ((tHidData *)device->pClassData)->state = HID_IDLE;
  return USBD_OK;
  }
//}}}
//{{{
static uint8_t* hidGetDeviceQualifierDesc (uint16_t* length) {
  *length = sizeof (hidDeviceQualifierDesc);
  return (uint8_t*)hidDeviceQualifierDesc;
  }
//}}}

//{{{
uint8_t hidSendReport (USBD_HandleTypeDef* device, uint8_t* report, uint16_t len) {

  tHidData* hhid = (tHidData*)device->pClassData;
  if (device->dev_state == USBD_STATE_CONFIGURED ) {
    if(hhid->state == HID_IDLE) {
      hhid->state = HID_BUSY;
      USBD_LL_Transmit (device, HID_EPIN_ADDR, report, len);
    }
  }
  return USBD_OK;
}
//}}}
//{{{
uint32_t hidGetPollingInterval (USBD_HandleTypeDef* device)
{
  uint32_t polling_interval = 0;

  /* HIGH-speed endpoints */
  if(device->dev_speed == USBD_SPEED_HIGH)
   /* Sets the data transfer polling interval for high speed transfers.
    Values between 1..16 are allowed. Values correspond to interval
    of 2 ^ (bInterval-1). This option (8 ms, corresponds to HID_HS_BINTERVAL */
    polling_interval = (((1 <<(HID_HS_BINTERVAL - 1)))/8);
  else   /* LOW and FULL-speed endpoints */
    /* Sets the data transfer polling interval for low and full
    speed transfers */
    polling_interval =  HID_FS_BINTERVAL;

  return ((uint32_t)(polling_interval));
  }
//}}}

USBD_ClassTypeDef hidClass = {
  hidInit,
  hidDeInit,
  hidSetup,
  NULL, //EP0_TxSent
  NULL, //EP0_RxReady
  hidDataIn,
  NULL, // DataOut
  NULL, // SOF
  NULL,
  NULL,
  hidGetCfgDesc,
  hidGetCfgDesc,
  hidGetCfgDesc,
  hidGetDeviceQualifierDesc,
  };
//}}}

USBD_HandleTypeDef gUsbDevice;
PCD_HandleTypeDef gPcdHandle;
//{{{  interrupt, system handlers
void NMI_Handler() {}
void SVC_Handler() {}
void PendSV_Handler() {}
void DebugMon_Handler() {}

void BusFault_Handler() { while (1) {} }
void HardFault_Handler() { while (1) {} }
void MemManage_Handler() { while (1) {} }
void UsageFault_Handler() { while (1) {} }

void SysTick_Handler() { HAL_IncTick(); }

void OTG_FS_IRQHandler() { HAL_PCD_IRQHandler (&gPcdHandle); }
//}}}
//{{{  usbd pcd handler
//{{{
void HAL_PCD_MspInit (PCD_HandleTypeDef* pcdHandle) {

  GPIO_InitTypeDef GPIO_InitStruct;

  __HAL_RCC_GPIOA_CLK_ENABLE();

  /* Configure DM DP Pins */
  GPIO_InitStruct.Pin = (GPIO_PIN_11 | GPIO_PIN_12);
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init (GPIOA, &GPIO_InitStruct);

  /* Enable USB FS Clock */
  __HAL_RCC_USB_OTG_FS_CLK_ENABLE();

  /* Set USBFS Interrupt priority */
  HAL_NVIC_SetPriority (OTG_FS_IRQn, 5, 0);

  /* Enable USBFS Interrupt */
  HAL_NVIC_EnableIRQ (OTG_FS_IRQn);
  }
//}}}
//{{{
void HAL_PCD_MspDeInit (PCD_HandleTypeDef* pcdHandle) {

  /* Disable USB FS Clock */
  __HAL_RCC_USB_OTG_FS_CLK_DISABLE();
  __HAL_RCC_SYSCFG_CLK_DISABLE();
  }
//}}}

